garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1559.PIC
        <edc:SFRDef edc:access="nnrn----" edc:cname="PWM1CON" edc:desc="Configurable logic cell control" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00x0----" edc:name="PWM1CON" edc:nzwidth="8" edc:por="00x0----" edc:_modsrc="DOS-01435.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x613">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM1CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM1POL" edc:desc="" edc:mask="0x1" edc:name="PWM1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1OUT" edc:desc="" edc:mask="0x1" edc:name="PWM1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1OE" edc:desc="" edc:mask="0x1" edc:name="PWM1OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1EN" edc:desc="" edc:mask="0x1" edc:name="PWM1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------" edc:cname="PWM2DCL" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------" edc:name="PWM2DCL" edc:nzwidth="8" edc:por="xx------" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x614">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCL" edc:desc="" edc:mask="0x3" edc:name="PWM2DCL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCL0" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCL1" edc:desc="" edc:mask="0x1" edc:name="PWM2DCL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM2DCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PWM2DCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x615">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM2DCH" edc:desc="" edc:mask="0xff" edc:name="PWM2DCH" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM2DCH0" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH1" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH2" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH3" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH4" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH5" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH6" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2DCH7" edc:desc="" edc:mask="0x1" edc:name="PWM2DCH7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrn----" edc:cname="PWM2CON" edc:desc="Configurable logic cell control" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00x0----" edc:name="PWM2CON" edc:nzwidth="8" edc:por="00x0----" edc:_modsrc="DOS-01435.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x616">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM2CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2POL" edc:desc="" edc:mask="0x1" edc:name="PWM2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OUT" edc:desc="" edc:mask="0x1" edc:name="PWM2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2OE" edc:desc="" edc:mask="0x1" edc:name="PWM2OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2EN" edc:desc="" edc:mask="0x1" edc:name="PWM2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x700"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x70C"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AD1CON0" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AD1CON0" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x711">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON0"/>
            <edc:LegacyAlias edc:cname="AAD1CON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHS" edc:desc="" edc:mask="0x1f" edc:name="CHS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS0" edc:desc="" edc:mask="0x1" edc:name="CHS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS1" edc:desc="" edc:mask="0x1" edc:name="CHS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS2" edc:desc="" edc:mask="0x1" edc:name="CHS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS3" edc:desc="" edc:mask="0x1" edc:name="CHS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHS4" edc:desc="" edc:mask="0x1" edc:name="CHS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE1" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="ADCOMCON" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="ADCOMCON" edc:nzwidth="8" edc:por="0000-000" edc:_addr="0x712">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AADCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPREF" edc:desc="" edc:mask="0x3" edc:name="ADPREF" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="GO_nDONE_ALL" edc:desc="" edc:mask="0x1" edc:name="GO_nDONE_ALL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0x7" edc:name="ADCS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:desc="" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPREF0" edc:desc="" edc:mask="0x1" edc:name="ADPREF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPREF1" edc:desc="" edc:mask="0x1" edc:name="ADPREF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GO_ALL" edc:desc="" edc:mask="0x1" edc:name="GO_ALL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCS0" edc:desc="" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:desc="" edc:mask="0x1" edc:name="ADCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:desc="" edc:mask="0x1" edc:name="ADCS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
