garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1559.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="AD2CAPCON" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="AD2CAPCON" edc:nzwidth="8" edc:por="----0000" edc:_addr="0x799">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2CAP"/>
            <edc:LegacyAlias edc:cname="AAD2CAPCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADDCAP" edc:desc="" edc:mask="0xf" edc:name="ADDCAP" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCAP" edc:desc="" edc:mask="0xf" edc:name="ADCAP" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADDCAP0" edc:desc="" edc:mask="0x1" edc:name="ADDCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDCAP1" edc:desc="" edc:mask="0x1" edc:name="ADDCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDCAP2" edc:desc="" edc:mask="0x1" edc:name="ADDCAP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDCAP3" edc:desc="" edc:mask="0x1" edc:name="ADDCAP3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ADD2CAP" edc:desc="" edc:mask="0xf" edc:name="ADD2CAP" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="AAD2RES0" edc:desc="" edc:name="AAD2RES0" edc:nzwidth="0x10" edc:_addr="0x79A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AD2RES0"/>
          </edc:AliasList>
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AAD2RES0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AAD2RES0L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x79A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESL" edc:desc="" edc:mask="0xff" edc:name="ADRESL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AAD2RES0H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AAD2RES0H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x79B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESH" edc:desc="" edc:mask="0xff" edc:name="ADRESH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="AAD2RES1" edc:desc="" edc:name="AAD2RES1" edc:nzwidth="0x10" edc:_addr="0x79C">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AD2RES1"/>
          </edc:AliasList>
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AAD2RES1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AAD2RES1L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x79C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESL" edc:desc="" edc:mask="0xff" edc:name="ADRESL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AAD2RES1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AAD2RES1H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0x79D">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRESH" edc:desc="" edc:mask="0xff" edc:name="ADRESH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AD2CH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AD2CH" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x79E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="AAD2CH"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CH20" edc:desc="" edc:mask="0x1" edc:name="CH20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH21" edc:desc="" edc:mask="0x1" edc:name="CH21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH22" edc:desc="" edc:mask="0x1" edc:name="CH22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH23" edc:desc="" edc:mask="0x1" edc:name="CH23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH24" edc:desc="" edc:mask="0x1" edc:name="CH24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH25" edc:desc="" edc:mask="0x1" edc:name="CH25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH26" edc:desc="" edc:mask="0x1" edc:name="CH26" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x800"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x880"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x900"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x980"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xA80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xB80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xC80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xda0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xD80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe20" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="29" edc:beginaddr="0xe80" edc:endaddr="0xea0" edc:regionid="sfr29">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xE80"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="30" edc:beginaddr="0xf00" edc:endaddr="0xf20" edc:regionid="sfr30">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF00"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF80"/>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="ICDIO" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxx--" edc:name="ICDIO" edc:nzwidth="8" edc:por="xxxxxx--" edc:_addr="0xF8C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TRIS_ICDCLK" edc:desc="" edc:mask="0x1" edc:name="TRIS_ICDCLK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIS_ICDDAT" edc:desc="" edc:mask="0x1" edc:name="TRIS_ICDDAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LAT_ICDCLK" edc:desc="" edc:mask="0x1" edc:name="LAT_ICDCLK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LAT_ICDDAT" edc:desc="" edc:mask="0x1" edc:name="LAT_ICDDAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PORT_ICDCLK" edc:desc="" edc:mask="0x1" edc:name="PORT_ICDCLK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PORT_ICDDAT" edc:desc="" edc:mask="0x1" edc:name="PORT_ICDDAT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n--n" edc:cname="ICDCON0" edc:desc="" edc:impl="0xe9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxx-x--x" edc:name="ICDCON0" edc:nzwidth="8" edc:por="xxx-x--x" edc:_addr="0xF8D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSTVEC" edc:desc="" edc:mask="0x1" edc:name="RSTVEC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DBGINEX" edc:desc="" edc:mask="0x1" edc:name="DBGINEX" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SSTEP" edc:desc="" edc:mask="0x1" edc:name="SSTEP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FREEZ" edc:desc="" edc:mask="0x1" edc:name="FREEZ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INBUG" edc:desc="" edc:mask="0x1" edc:name="INBUG" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0xF8E"/>
        <edc:SFRDef edc:access="nn----n-" edc:cname="ICDSTAT" edc:desc="" edc:impl="0xc2" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx----x-" edc:name="ICDSTAT" edc:nzwidth="8" edc:por="xx----x-" edc:_addr="0xF91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="USRHLTF" edc:desc="" edc:mask="0x1" edc:name="USRHLTF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRP0HLTF" edc:desc="" edc:mask="0x1" edc:name="TRP0HLTF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRP1HLTF" edc:desc="" edc:mask="0x1" edc:name="TRP1HLTF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
